#BASICS SQL ASSIGNMENTS QUESTIONS:

Q1.Create a table called employees with the following structure?

: emp_id (integer, should not be NULL and should be a primary key)

: emp_name (text, should not be NULL)

: age (integer, should have a check constraint to ensure the age is at least 18)

: email (text, should be unique for each employee)

: salary (decimal, with a default value of 30,000).

Write the SQL query to create the above table with all constraints.

In [ ]:
CREATE TABLE employees (
    emp_id INTEGER NOT NULL PRIMARY KEY,
    emp_name TEXT NOT NULL,
    age INTEGER CHECK (age >= 18),
    email TEXT UNIQUE,
    salary DECIMAL DEFAULT 30000)

Q2.. Explain the purpose of constraints and how they help maintain data integrity in a database. Provide
examples of common types of constraints.

.Constraints help enforce rules at the database level, preventing the entry of invalid data and ensuring data accuracy and reliability. Implementing various types of constraints such as primary key, foreign key, unique, not null, check, and default constraints is crucial for upholding data quality.

Entity integrity constraints are used to maintain the accuracy and consistency of data within a database by ensuring that each record is unique and that no duplicate records exist.

Q3..Why would you apply the NOT NULL constraint to a column? Can a primary key contain NULL values? Justify
your answer.

.You apply the NOT NULL constraint to a column to ensure that every record in that column contains a value and not a NULL value, which is essential for maintaining data integrity and consistency. A primary key, by definition, cannot contain NULL values because it needs to uniquely identify each row, and NULL values would violate this uniqueness requirement.

Q4. Explain the steps and SQL commands used to add or remove constraints on an existing table. Provide an
example for both adding and removing a constraint.

.If we want to remove a constraint from a table, we can run the following command: ALTER TABLE table DROP CONSTRAINT constraint_name; To drop a constraint, we need to specify its name. In CockroachDB, we can easily find the name of a specific constraint by running SHOW CONSTRAINTS FROM table_name; .

For example, to add a unique constraint to the fname and lname columns of the customer table, use the following statement: ALTER TABLE customer ADD CONSTRAINT UNIQUE (lname, fname);

Q5. Explain the consequences of attempting to insert, update, or delete data in a way that violates constraints.
Provide an example of an error message that might occur when violating a constraint.

.Attempting to insert, update, or delete data that violates database constraints will result in the operation failing and generating an error message, preventing data inconsistencies and maintaining data integrity.

Here's a breakdown;

Consequences of Constraint Violations:

Operation Failure:

The database will reject the attempted insert, update, or delete operation if it violates any defined constraints.

Data Integrity:

Constraints are designed to enforce rules and ensure data accuracy and consistency within the database. Violating them would lead to data corruption or inconsistencies.

Error Messages:

The database system will typically return an error message indicating the nature of the constraint violation.

Types of Constraints and Examples:

Primary Key:

A primary key constraint ensures that a column or set of columns uniquely identifies each row in a table.
Example: If you try to insert a new row with the same primary key value as an existing row, you'll get an error.

Foreign Key:

A foreign key constraint establishes a relationship between two tables by referencing the primary key of another table.
Example: If you try to insert a value into a foreign key column that doesn't exist in the primary key column of the related table, you'll get an error.
Unique:

A unique constraint ensures that a column or set of columns contains only unique values.

Example: If you try to insert a value into a unique column that already exists, you'll get an error.

Q6.You created a products table without constraints as follows:

CREATE TABLE products (

    product_id INT,

    product_name VARCHAR(50),

    price DECIMAL(10, 2));
Now, you realise that?
: The product_id should be a primary key
: The price should have a default value of 50.00


.

In [ ]:
ALTER TABLE products
ADD CONSTRAINT pk_product_id PRIMARY KEY (product_id);

ALTER TABLE products
ALTER COLUMN price SET DEFAULT 50.00;

Q7.Write a query to fetch the student_name and class_name for each student using an INNER JOIN.

.

In [ ]:
SELECT Students.student_name, Classes.class_name
FROM Students
INNER JOIN Classes ON Students.class_id = Classes.class_id;

Q8.Write a query that shows all order_id, customer_name, and product_name, ensuring that all products are
listed even if they are not associated with an order

Hint: (use INNER JOIN and LEFT JOIN)

In [ ]:
SELECT Orders.order_id, Customers.customer_name, Products.product_name
FROM Products
LEFT JOIN Orders ON Products.order_id = Orders.order_id
LEFT JOIN Customers ON Orders.customer_id = Customers.customer_id;

Q9.Write a query to find the total sales amount for each product using an INNER JOIN and the SUM() function.

In [ ]:
SELECT Products.product_name, SUM(Sales.amount) AS total_sales
FROM Sales
INNER JOIN Products ON Sales.product_id = Products.product_id
GROUP BY Products.product_name;

Q1O.Write a query to display the order_id, customer_name, and the quantity of products ordered by each
customer using an INNER JOIN between all three tables.

In [ ]:
SELECT Orders.order_id, Customers.customer_name, SUM(Order_Details.quantity) AS total_quantity
FROM Orders
INNER JOIN Customers ON Orders.customer_id = Customers.customer_id
INNER JOIN Order_Details ON Orders.order_id = Order_Details.order_id
GROUP BY Orders.order_id, Customers.customer_name;

#SQL COMMANDS:

1.Identify the primary keys and foreign keys in maven movies db. Discuss the differences.

.The primary key is a unique identifier within its table, whereas a foreign key is a reference in one table to a primary key in another. Primary keys enforce uniqueness within their table, ensuring each record is identifiable.

2. List all details of actors.

.The SELECT statement is used to select data from a database.

3. -List all customer information from DB.

In [ ]:
SELECT table_name FROM INFORMATION_SCHEMA. TABLES WHERE table_type = 'BASE TABLE' SELECT name FROM sys.

4. -List different countries

In [ ]:

CREATE TABLE IF NOT EXISTS countries (
CHECK(COUNTRY_NAME IN('Italy','India','China')) ,
INSERT INTO countries(country_id,country_name,region_id) VALUES (1,'Italy','11572');
INSERT INTO countries(country_id,country_name,region_id) VALUES (2,'India','11573');
21 Sept 2021

5.Display all active customers.

.The command is: SELECT user(); The output provides the information about the current user who is running that query. If you possess admin rights, you can observe the list of currently logged-in database users in MySQL or MariaDB by querying the information_schema.

6. -List of all rental IDs for customer with ID 1.

In [ ]:
SELECT rental_id, car_id, customer_id, distance_km FROM Rentals WHERE EXTRACT(MONTH FROM rental_date) = 8 AND EXTRACT(YEAR FROM rental_date) = 2019 ORDER BY rental_id;

7. Display all the films whose rental duration is greater than 5

In [ ]:
SELECT *
FROM film
WHERE rental_duration > 5;

8. List the total number of films whose replacement cost is greater than $15 and less than $20.

In [ ]:
SELECT COUNT(*) AS total_films
FROM film
WHERE replacement_cost > 15 AND replacement_cost < 20;

9. Display the count of unique first names of actors.

In [ ]:
SELECT COUNT(DISTINCT first_name) AS unique_first_names
FROM actor;

10.- Display the first 10 records from the customer table .

In [ ]:
SELECT *
FROM customer
LIMIT 10;

11. Display the first 3 records from the customer table whose first name starts with ‘b’.

In [ ]:
SELECT *
FROM customer
WHERE first_name LIKE 'B%'
LIMIT 3;

12.-Display the names of the first 5 movies which are rated as ‘G’.

In [ ]:
SELECT title
FROM film
WHERE rating = 'G'
LIMIT 5;

13.Find all customers whose first name starts with "a".

In [ ]:
SELECT *
FROM customer
WHERE first_name LIKE 'A%';

14. Find all customers whose first name ends with "a".

In [ ]:
SELECT *
FROM customer
WHERE first_name LIKE '%a';

15.- Display the list of first 4 cities which start and end with ‘a’ .

In [ ]:
SELECT city
FROM city
WHERE city LIKE 'A%a'
LIMIT 4;

16. Find all customers whose first name have "NI" in any position.

In [ ]:
SELECT *
FROM customer
WHERE first_name LIKE '%NI%';

17. Find all customers whose first name have "r" in the second position .

In [ ]:
SELECT *
FROM customer
WHERE first_name LIKE '_r%';

18. Find all customers whose first name starts with "a" and are at least 5 characters in length.

In [ ]:
SELECT *
FROM customer
WHERE first_name LIKE 'A%'
AND LENGTH(first_name) >= 5;

19.Find all customers whose first name starts with "a" and ends with "o".

In [ ]:
SELECT *
FROM customer
WHERE first_name LIKE 'A%o';

20.Get the films with pg and pg-13 rating using IN operator.

In [ ]:
SELECT *
FROM film
WHERE rating IN ('PG', 'PG-13');

21.- Get the films with length between 50 to 100 using between operator.

In [ ]:
SELECT *
FROM film
WHERE length BETWEEN 50 AND 100;

22.Get the top 50 actors using limit operator.

In [ ]:
SELECT *
FROM actor
LIMIT 50;

23.Get the distinct film ids from inventory table

In [ ]:
SELECT DISTINCT film_id
FROM inventory;

#FUNCTIONS:

# Basic Aggregate Functions:

Q1.Retrieve the total number of rentals made in the Sakila database.

Hint: Use the COUNT() function.


.

In [ ]:
SELECT COUNT(*) AS total_rentals
FROM rental;

Q2.Find the average rental duration (in days) of movies rented from the Sakila database.

Hint: Utilize the AVG() function.

In [ ]:
SELECT AVG(rental_duration) AS average_rental_duration
FROM film;

Q3.Display the first name and last name of customers in uppercase.

Hint: Use the UPPER () function.

In [ ]:
SELECT UPPER(first_name) AS first_name_upper,
       UPPER(last_name) AS last_name_upper
FROM customer;

Q4.Extract the month from the rental date and display it alongside the rental ID.

Hint: Employ the MONTH() function.

In [ ]:
SELECT rental_id, MONTH(rental_date) AS rental_month
FROM rental;

Q5.Retrieve the count of rentals for each customer (display customer ID and the count of rentals).

Hint: Use COUNT () in conjunction with GROUP BY.

In [ ]:
SELECT customer_id, COUNT(*) AS rental_count
FROM rental
GROUP BY customer_id;

Q6.Find the total revenue generated by each store.

Hint: Combine SUM() and GROUP BY.

In [ ]:
SELECT s.store_id, SUM(p.amount) AS total_revenue
FROM payment p
JOIN customer c ON p.customer_id = c.customer_id
JOIN store s ON c.store_id = s.store_id
GROUP BY s.store_id;

Q7.Determine the total number of rentals for each category of movies.

Hint: JOIN film_category, film, and rental tables, then use cOUNT () and GROUP BY.

In [ ]:
SELECT c.name AS category_name, COUNT(r.rental_id) AS total_rentals
FROM rental r
JOIN inventory i ON r.inventory_id = i.inventory_id
JOIN film f ON i.film_id = f.film_id
JOIN film_category fc ON f.film_id = fc.film_id
JOIN category c ON fc.category_id = c.category_id
GROUP BY c.name;

Q8.Find the average rental rate of movies in each language.

Hint: JOIN film and language tables, then use AVG () and GROUP BY.

In [ ]:
SELECT l.name AS language_name, AVG(f.rental_rate) AS average_rental_rate
FROM film f
JOIN language l ON f.language_id = l.language_id
GROUP BY l.name;

Q9.Display the title of the movie, customer s first name, and last name who rented it.

Hint: Use JOIN between the film, inventory, rental, and customer tables.

In [ ]:
SELECT f.title AS movie_title, c.first_name, c.last_name
FROM rental r
JOIN inventory i ON r.inventory_id = i.inventory_id
JOIN film f ON i.film_id = f.film_id
JOIN customer c ON r.customer_id = c.customer_id;

Q10.Retrieve the names of all actors who have appeared in the film "Gone with the Wind."

Hint: Use JOIN between the film actor, film, and actor tables.

In [ ]:
SELECT a.first_name, a.last_name
FROM actor a
JOIN film_actor fa ON a.actor_id = fa.actor_id
JOIN film f ON fa.film_id = f.film_id
WHERE f.title = 'Gone with the Wind';

Q11.Retrieve the customer names along with the total amount they've spent on rentals.

Hint: JOIN customer, payment, and rental tables, then use SUM() and GROUP BY.

In [ ]:
SELECT c.first_name, c.last_name, SUM(p.amount) AS total_amount_spent
FROM customer c
JOIN payment p ON c.customer_id = p.customer_id
GROUP BY c.first_name, c.last_name
ORDER BY total_amount_spent DESC;

Q12.List the titles of movies rented by each customer in a particular city (e.g., 'London').

Hint: JOIN customer, address, city, rental, inventory, and film tables, then use GROUP BY.

In [ ]:
SELECT c.first_name, c.last_name, ci.city, f.title AS movie_title
FROM customer c
JOIN address a ON c.address_id = a.address_id
JOIN city ci ON a.city_id = ci.city_id
JOIN rental r ON c.customer_id = r.customer_id
JOIN inventory i ON r.inventory_id = i.inventory_id
JOIN film f ON i.film_id = f.film_id
WHERE ci.city = 'London'
ORDER BY c.last_name, c.first_name, f.title;

Q13.Display the top 5 rented movies along with the number of times they've been rented.

Hint: JOIN film, inventory, and rental tables, then use COUNT () and GROUP BY, and limit the results.

In [ ]:
SELECT f.title AS movie_title, COUNT(r.rental_id) AS rental_count
FROM rental r
JOIN inventory i ON r.inventory_id = i.inventory_id
JOIN film f ON i.film_id = f.film_id
GROUP BY f.title
ORDER BY rental_count DESC
LIMIT 5;

Q14.Determine the customers who have rented movies from both stores (store ID 1 and store ID 2).

Hint: Use JOINS with rental, inventory, and customer tables and consider COUNT() and GROUP BY.

In [ ]:
SELECT c.customer_id, c.first_name, c.last_name
FROM rental r
JOIN inventory i ON r.inventory_id = i.inventory_id
JOIN store s ON i.store_id = s.store_id
JOIN customer c ON r.customer_id = c.customer_id
WHERE s.store_id IN (1, 2)
GROUP BY c.customer_id, c.first_name, c.last_name
HAVING COUNT(DISTINCT s.store_id) = 2;

#WINDOWS FUNCTION:

1.1. Rank the customers based on the total amount they've spent on rentals.

In [ ]:
SELECT c.customer_id, c.first_name, c.last_name,
       SUM(p.amount) AS total_amount_spent,
       RANK() OVER (ORDER BY SUM(p.amount) DESC) AS rank
FROM customer c
JOIN payment p ON c.customer_id = p.customer_id
GROUP BY c.customer_id, c.first_name, c.last_name
ORDER BY total_amount_spent DESC;

2.Calculate the cumulative revenue generated by each film over time.

In [ ]:
SELECT f.title AS movie_title, p.payment_date,
       SUM(p.amount) OVER (PARTITION BY f.film_id ORDER BY p.payment_date) AS cumulative_revenue
FROM payment p
JOIN rental r ON p.rental_id = r.rental_id
JOIN inventory i ON r.inventory_id = i.inventory_id
JOIN film f ON i.film_id = f.film_id
ORDER BY f.title, p.payment_date;

3.Determine the average rental duration for each film, considering films with similar lengths

In [ ]:
SELECT f.length AS film_length,
       f.title AS movie_title,
       AVG(f.rental_duration) AS avg_rental_duration
FROM film f
GROUP BY f.length, f.title
ORDER BY f.length, avg_rental_duration DESC;

4.. Identify the top 3 films in each category based on their rental counts.

In [ ]:
WITH FilmRentalCounts AS (
    SELECT fc.category_id, c.name AS category_name, f.title AS movie_title,
           COUNT(r.rental_id) AS rental_count,
           RANK() OVER (PARTITION BY fc.category_id ORDER BY COUNT(r.rental_id) DESC) AS rank
    FROM rental r
    JOIN inventory i ON r.inventory_id = i.inventory_id
    JOIN film f ON i.film_id = f.film_id
    JOIN film_category fc ON f.film_id = fc.film_id
    JOIN category c ON fc.category_id = c.category_id
    GROUP BY fc.category_id, c.name, f.title
)
SELECT category_name, movie_title, rental_count, rank
FROM FilmRentalCounts
WHERE rank <= 3
ORDER BY category_name, rank;

5.Calculate the difference in rental counts between each customer's total rentals and the average rentals

across all customers.

In [ ]:
WITH CustomerRentalCounts AS (
    SELECT c.customer_id, c.first_name, c.last_name,
           COUNT(r.rental_id) AS total_rentals
    FROM customer c
    JOIN rental r ON c.customer_id = r.customer_id
    GROUP BY c.customer_id, c.first_name, c.last_name
),
AverageRentals AS (
    SELECT AVG(total_rentals) AS avg_rentals
    FROM CustomerRentalCounts
)
SELECT c.customer_id, c.first_name, c.last_name,
       c.total_rentals,
       a.avg_rentals,
       (c.total_rentals - a.avg_rentals) AS rental_difference
FROM CustomerRentalCounts c
JOIN AverageRentals a
ORDER BY rental_difference DESC;

6.. Find the monthly revenue trend for the entire rental store over time.

In [ ]:
SELECT DATE_FORMAT(p.payment_date, '%Y-%m') AS month,
       SUM(p.amount) AS total_revenue
FROM payment p
GROUP BY month
ORDER BY month;

7.. Identify the customers whose total spending on rentals falls within the top 20% of all customers.

In [ ]:
WITH CustomerSpending AS (
    SELECT c.customer_id, c.first_name, c.last_name,
           SUM(p.amount) AS total_spent
    FROM customer c
    JOIN payment p ON c.customer_id = p.customer_id
    GROUP BY c.customer_id, c.first_name, c.last_name
),
SpendingPercentiles AS (
    SELECT total_spent,
           NTILE(5) OVER (ORDER BY total_spent DESC) AS percentile
    FROM CustomerSpending
)
SELECT cs.customer_id, cs.first_name, cs.last_name, cs.total_spent
FROM CustomerSpending cs
JOIN SpendingPercentiles sp ON cs.total_spent = sp.total_spent
WHERE sp.percentile = 1
ORDER BY cs.total_spent DESC;

8.Calculate the running total of rentals per category, ordered by rental count.

In [ ]:
WITH CategoryRentalCounts AS (
    SELECT c.category_id, c.name AS category_name,
           COUNT(r.rental_id) AS total_rentals
    FROM rental r
    JOIN inventory i ON r.inventory_id = i.inventory_id
    JOIN film f ON i.film_id = f.film_id
    JOIN film_category fc ON f.film_id = fc.film_id
    JOIN category c ON fc.category_id = c.category_id
    GROUP BY c.category_id, c.name
)
SELECT category_name, total_rentals,
       SUM(total_rentals) OVER (ORDER BY total_rentals DESC) AS running_total
FROM CategoryRentalCounts
ORDER BY total_rentals DESC;

9.Find the films that have been rented less than the average rental count for their respective categories.

In [ ]:
WITH CategoryAverageRentals AS (
    SELECT fc.category_id, c.name AS category_name,
           AVG(rental_count) AS avg_rentals_per_category
    FROM (
        SELECT f.film_id, fc.category_id, COUNT(r.rental_id) AS rental_count
        FROM rental r
        JOIN inventory i ON r.inventory_id = i.inventory_id
        JOIN film f ON i.film_id = f.film_id
        JOIN film_category fc ON f.film_id = fc.film_id
        GROUP BY f.film_id, fc.category_id
    ) FilmRentalCounts
    JOIN category c ON FilmRentalCounts.category_id = c.category_id
    GROUP BY fc.category_id, c.name
)
SELECT f.title AS movie_title, c.name AS category_name,
       COUNT(r.rental_id) AS film_rental_count, avg_r.avg_rentals_per_category
FROM rental r
JOIN inventory i ON r.inventory_id = i.inventory_id
JOIN film f ON i.film_id = f.film_id
JOIN film_category fc ON f.film_id = fc.film_id
JOIN category c ON fc.category_id = c.category_id
JOIN CategoryAverageRentals avg_r ON fc.category_id = avg_r.category_id
GROUP BY f.film_id, f.title, c.name, avg_r.avg_rentals_per_category
HAVING COUNT(r.rental_id) < avg_r.avg_rentals_per_category
ORDER BY category_name, film_rental_count ASC;

10. Identify the top 5 months with the highest revenue and display the revenue generated in each month.

In [ ]:
SELECT DATE_FORMAT(p.payment_date, '%Y-%m') AS month,
       SUM(p.amount) AS total_revenue
FROM payment p
GROUP BY month
ORDER BY total_revenue DESC
LIMIT 5;